nxp-appcodehub/an-kw4x-bluetooth-le-nfc-integration/kw45b41zevk_w_uart_ncf3320_basic_discovery/source/common/app_conn.c
/*! *********************************************************************************
* Copyright 2020-2022 NXP
* All rights reserved.
*
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

/************************************************************************************
*************************************************************************************
* Include
*************************************************************************************
************************************************************************************/
#include "EmbeddedTypes.h"

/* Components */
#include "fsl_os_abstraction.h"
#include "fsl_component_mem_manager.h"
#include "fsl_component_timer_manager.h"
#include "fsl_component_messaging.h"
#include "fsl_adapter_flash.h"
#include "fsl_component_panic.h"
#include "fsl_component_led.h"

/* Fwk */
#include "app.h"
#include "RNG_Interface.h"
#include "SecLib.h"
#include "board.h"
#if defined(gAppLowpowerEnabled_d) && (gAppLowpowerEnabled_d>0)
#include "PWR_Interface.h"
#endif /* gAppLowpowerEnabled_d */

#if defined (gAppOtaASyncFlashTransactions_c ) && (gAppOtaASyncFlashTransactions_c > 0)
#include "OtaSupport.h"
#endif

#if defined(gFsciIncluded_c) && (gFsciIncluded_c == 1)
#include "FsciInterface.h"
#if gFSCI_IncludeLpmCommands_c
#include "FsciCommands.h"
#endif /* gFSCI_IncludeLpmCommands_c */
#endif /* gFsciIncluded_c */

#if gAppUseNvm_d
#include "NVM_Interface.h"
#if defined(gFsciIncluded_c) && (gFsciIncluded_c == 1)
#include "NV_FsciCommands.h"
#endif /* gFsciIncluded_c */
#endif /* gAppUseNvm_d */

#include "fwk_platform_ble.h"

/* SDK */
#ifdef SDK_OS_FREE_RTOS
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "portmacro.h"
#endif /* SDK_OS_FREE_RTOS */

/* Application common */
#include "app_conn.h"
#include "fsl_os_abstraction.h"
#include "ble_conn_manager.h"
#include "controller_api.h"

/************************************************************************************
*************************************************************************************
* Private macros
*************************************************************************************
************************************************************************************/

/************************************************************************************
*************************************************************************************
* Private type definitions
*************************************************************************************
************************************************************************************/
typedef struct appMsgCallback_tag
{
    appCallbackHandler_t   handler;
    appCallbackParam_t     param;
} appMsgCallback_t;

/************************************************************************************
*************************************************************************************
* Private prototypes
*************************************************************************************
************************************************************************************/

static void App_HandleHostMessageInput
(
    appMsgFromHost_t* pMsg
);
static bool_t App_HandleHostMessageInput_Gap
(
    appMsgFromHost_t* pMsg
);
static bool_t App_HandleHostMessageInput_Gatt
(
    appMsgFromHost_t* pMsg
);
static bool_t App_HandleHostMessageInput_L2ca
(
    appMsgFromHost_t* pMsg
);
static void App_GenericHandler
(
    gapGenericEvent_t *pGenericEvent
);
STATIC void App_GattServerCallback
(
    deviceId_t         peerDeviceId,
    gattServerEvent_t* pServerEvent
);
STATIC void App_GattClientProcedureCallback
(
    deviceId_t              deviceId,
    gattProcedureType_t     procedureType,
    gattProcedureResult_t   procedureResult,
    bleResult_t             error
);
STATIC void App_GattClientNotificationCallback
(
    deviceId_t      deviceId,
    uint16_t        characteristicValueHandle,
    uint8_t*        aValue,
    uint16_t        valueLength
);
STATIC void App_GattClientIndicationCallback
(
    deviceId_t      deviceId,
    uint16_t        characteristicValueHandle,
    uint8_t*        aValue,
    uint16_t        valueLength
);
STATIC void App_L2caLeDataCallback
(
    deviceId_t deviceId,
    uint16_t channelId,
    uint8_t* pPacket,
    uint16_t packetLength
);
STATIC void App_L2caLeControlCallback
(
    l2capControlMessage_t* pMessage
);

#if defined(gAppLowpowerEnabled_d) && (gAppLowpowerEnabled_d>0)
static const Seclib_LowpowerCriticalCBs_t app_LowpowerCriticalCBs =
{
   .SeclibEnterLowpowerCriticalFunc = &PWR_LowPowerEnterCritical,
   .SeclibExitLowpowerCriticalFunc  = &PWR_LowPowerExitCritical,
};
#endif

/*! *********************************************************************************
*************************************************************************************
* Public prototypes
*************************************************************************************
********************************************************************************** */

/************************************************************************************
*************************************************************************************
* Private memory declarations
*************************************************************************************
************************************************************************************/
static appBluetoothLEInitCompleteCallback_t mpfInitDoneCallback       = NULL;
static gapGenericCallback_t                 mpfAppGenericCallback     = NULL;
static gapGenericCallback_t                 mpfGenericHandler         = NULL;
static gattServerCallback_t                 pfGattServerCallback      = NULL;
static gattClientProcedureCallback_t        pfGattClientProcCallback  = NULL;
static gattClientNotificationCallback_t     pfGattClientNotifCallback = NULL;
static gattClientNotificationCallback_t     pfGattClientIndCallback   = NULL;
static l2caLeCbDataCallback_t               pfL2caLeCbDataCallback    = NULL;
static l2caLeCbControlCallback_t            pfL2caLeCbControlCallback = NULL;

/* Application input queues */
static messaging_t mAppCbInputQueue;

/************************************************************************************
*************************************************************************************
* Public memory declarations
*************************************************************************************
************************************************************************************/

OSA_EVENT_HANDLE_DEFINE(mAppEvent);
appAdvertiserHandler_t   pfAdvertiserHandler = NULL;

gapAdvertisingCallback_t pfAdvCallback       = NULL;     /* Set only if advertising is used */
gapScanningCallback_t    pfScanCallback      = NULL;     /* Set only if scanning is used */
gapConnectionCallback_t  pfConnCallback      = NULL;     /* Set only if connection is used */

/* Application input queues */
messaging_t mHostAppInputQueue;

/************************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
*\fn           void BluetoothLEHost_Init(
*                  appBluetoothLEInitCompleteCallback_t pCallback
*              )
*\brief        This is the host initialization function (initialize the Bluetooth LE
*              stack and also all framework and controller required components).
*
*\param  [in]  pCallback    Callback triggered when the initialization is
*                           complete.
*
*\retval       void.
********************************************************************************** */
void BluetoothLEHost_Init
(
    appBluetoothLEInitCompleteCallback_t pCallback
)
{
        (void)MEM_Init();

