nxp-appcodehub/an-kw4x-bluetooth-le-nfc-integration/kw45b41zevk_w_uart_ncf3320_basic_discovery/source/common/app_conn.c
        /* Framework init */
#if defined(gRngSeedStorageAddr_d) || defined(gXcvrDacTrimValueSorageAddr_d)
        NV_Init();
#endif /* gRngSeedStorageAddr_d || gXcvrDacTrimValueSorageAddr_d */

        /* Cryptographic hardware initialization */
        SecLib_Init();
#if defined(gAppLowpowerEnabled_d) && (gAppLowpowerEnabled_d>0)
        /* Register PWR functions into SecLib module in order to disable device lowpower
            during Seclib processing. Typically, allow only WFI instruction when
            commands (key generation, encryption) are processed by Seclib  */
        SecLib_SetLowpowerCriticalCb(&app_LowpowerCriticalCBs);
#endif

        /* RNG software initialization and PRNG initial seeding (from hardware) */
        (void)RNG_Init();
        RNG_SetPseudoRandomNoSeed(NULL);

        /*Has to be called after RNG_Init(), once seed is generated.*/
        (void)Controller_SetRandomSeed();
#if (defined(gAppSecureMode_d) && (gAppSecureMode_d > 0U))        
        (void)PLATFORM_EnableBleSecureKeyManagement();
#endif
#if defined(gAppUseNvm_d) && (gAppUseNvm_d>0)
        /* Initialize NV module */
        (void)NvModuleInit();
#endif /* gAppUseNvm_d */

        /* Create application event */
        (void)OSA_EventCreate(mAppEvent, TRUE);

        /* Prepare application input queue.*/
        MSG_QueueInit(&mHostAppInputQueue);

        /* Prepare callback input queue.*/
        MSG_QueueInit(&mAppCbInputQueue);

        /* BLE common part */
        mpfInitDoneCallback = pCallback;
        mpfGenericHandler = App_GenericHandler;

        /* BLE Host Stack Init */
        if (Ble_Initialize(App_GenericCallback) != gBleSuccess_c)
        {
            panic(0,0,0,0);
            return;
        }

#if (gAppUseNvm_d && defined(gFsciIncluded_c) && (gFsciIncluded_c))
#if gNvmEnableFSCIMonitoring_c
        NV_SetFSCIMonitoringState(TRUE);
#endif /* gNvmEnableFSCIMonitoring_c */
#if gNvmEnableFSCIRequests_c
        NV_RegisterToFSCI();
#endif /* gNvmEnableFSCIRequests_c */
#endif /* gAppUseNvm_d && gFsciIncluded_c */

    /* configure tx power to use in NBU specfic to BLE */
    (void)Controller_SetTxPowerLevelDbm(mAdvertisingDefaultTxPower_c, gAdvTxChannel_c);
    (void)Controller_SetTxPowerLevelDbm(mConnectionDefaultTxPower_c, gConnTxChannel_c);
    (void)Controller_ConfigureInvalidPduHandling(gLlInvalidPduHandlingType_c);
}

/*! *********************************************************************************
*\fn           void BluetoothLEHost_HandleMessages(void)
*\brief        This function is responsible for consuming all events coming from the
*              Bluetooth LE stack.
*
*\param  [in]  none.
*
*\retval       void.
********************************************************************************** */
void BluetoothLEHost_HandleMessages(void)
{
#ifdef SDK_OS_FREE_RTOS
    osa_event_flags_t event = 0U;
    (void)OSA_EventWait((osa_event_handle_t)mAppEvent,
                        osaEventFlagsAll_c,
                        FALSE,
                        gAppTaskWaitTimeout_ms_c ,
                        &event);
#endif /* SDK_OS_FREE_RTOS */

    /* Check for existing messages in queue */
    if (MSG_QueueGetHead(&mHostAppInputQueue) != NULL)
    {
        /* Pointer for storing the messages from host. */
        appMsgFromHost_t *pMsgIn = MSG_QueueRemoveHead(&mHostAppInputQueue);

        if (pMsgIn != NULL)
        {
            /* Process it */
            App_HandleHostMessageInput(pMsgIn);

            /* Messages must always be freed. */
            (void)MSG_Free(pMsgIn);
        }
    }

    /* Check for existing messages in queue */
    if (MSG_QueueGetHead(&mAppCbInputQueue) != NULL)
    {
        /* Pointer for storing the callback messages. */
        appMsgCallback_t *pMsgIn = MSG_QueueGetHead(&mAppCbInputQueue);

        if (pMsgIn != NULL)
        {
            /* Execute callback handler */
            if (pMsgIn->handler != NULL)
            {
                pMsgIn->handler(pMsgIn->param);
            }

            /* Messages must always be freed. */
            (void)MSG_Free(pMsgIn);
        }
    }

#ifdef SDK_OS_FREE_RTOS
    /* Signal the main_thread again if there are more messages pending */
    event = (MSG_QueueGetHead(&mHostAppInputQueue) != NULL) ? gAppEvtMsgFromHostStack_c : 0U;
    event |= (MSG_QueueGetHead(&mAppCbInputQueue) != NULL) ? gAppEvtAppCallback_c : 0U;
    if (event != 0U)
    {
    	(void)OSA_EventSet((osa_event_handle_t)mAppEvent, gAppEvtAppCallback_c);
    }
#endif /* SDK_OS_FREE_RTOS */
}


/*! *********************************************************************************
*\fn           void BluetoothLEHost_IsMessagePending(void)
*\brief        This function checks whether Messages are pending to be processed.
*
*\param  [in]  none.
*
*\retval       TRUE if pending messages.
********************************************************************************** */
bool BluetoothLEHost_IsMessagePending(void)
{
    bool ret = FALSE;
     /* Check for existing messages in queue */
    if ( (MSG_QueueGetHead(&mHostAppInputQueue) != NULL) || (MSG_QueueGetHead(&mAppCbInputQueue) != NULL) )
    {
        ret = TRUE;
    }
    return ret;
}

/*! *********************************************************************************
\fn            void BluetoothLEHost_SetGenericCallback(
*                  gapGenericCallback_t pfGenericCallback
*              )
*\brief        Set advanced generic callback. Set a callback to receive all Bluetooth
*              LE stack generic events.
*
*\param  [in]  pfGenericCallback    Callback used by the application to receive all
*                                   stack generic events.
*
*\retval       void.
********************************************************************************** */
void BluetoothLEHost_SetGenericCallback
(
    gapGenericCallback_t pfGenericCallback
)
{
    mpfAppGenericCallback = pfGenericCallback;
}

/*! *********************************************************************************
\fn            bleResult_t App_RegisterGattServerCallback(
*                  gattServerCallback_t serverCallback)
*\brief        Set application gatt server callback and install static callback for
*              the GATT Server module.
*
*\param  [in]  serverCallback    Callback used by the application to receive gatt
*                                server events.
*
*\return       bleResult_t        Result of the operation.
********************************************************************************** */
bleResult_t App_RegisterGattServerCallback
(
    gattServerCallback_t serverCallback
)
{
    pfGattServerCallback = serverCallback;

