nxp-appcodehub/an-kw4x-bluetooth-le-nfc-integration/kw45b41zevk_w_uart_ncf3320_basic_discovery/source/common/app_conn.c
    return GattServer_RegisterCallback(App_GattServerCallback);
}

/*! *********************************************************************************
\fn            bleResult_t App_RegisterGattClientProcedureCallback(
*                  gattClientProcedureCallback_t  callback)
*\brief        Set application gatt client callback and install static callback for
*              the GATT Client module procedures.
*
*\param  [in]  callback       Callback used by the application to receive gatt
*                             client events.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t App_RegisterGattClientProcedureCallback
(
    gattClientProcedureCallback_t  callback
)
{
    pfGattClientProcCallback = callback;

    return GattClient_RegisterProcedureCallback(App_GattClientProcedureCallback);
}

/*! *********************************************************************************
\fn            bleResult_t App_RegisterGattClientNotificationCallback(
*                  gattClientNotificationCallback_t  callback)
*\brief        Set application gatt client notification callback and install static
*              callback for Gatt server notifications.
*
*\param  [in]  callback       Callback used by the application to receive gatt
*                             server notifications.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t App_RegisterGattClientNotificationCallback
(
    gattClientNotificationCallback_t  callback
)
{
    pfGattClientNotifCallback = callback;

    return GattClient_RegisterNotificationCallback(App_GattClientNotificationCallback);
}

/*! *********************************************************************************
\fn            bleResult_t App_RegisterGattClientIndicationCallback(
*                  gattClientIndicationCallback_t  callback)
*\brief        Set application gatt client indication callback and install static
*              callback for Gatt server indications.
*
*\param  [in]  callback       Callback used by the application to receive gatt
*                             server indications.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t App_RegisterGattClientIndicationCallback
(
    gattClientIndicationCallback_t  callback
)
{
    pfGattClientIndCallback = callback;

    return GattClient_RegisterIndicationCallback(App_GattClientIndicationCallback);
}

/*! *********************************************************************************
\fn            bleResult_t App_RegisterLeCbCallbacks(
*                  l2caLeCbDataCallback_t      pCallback,
*                  l2caLeCbControlCallback_t   pCtrlCallback
*              )
*\brief        Set application L2CAP callbacks for credit based data and control
*              events and register static callbacks on L2CAP.
*
*\param  [in]  pCallback      Callback function for data plane messages.
*\param  [in]  pCtrlCallback  Callback function for control plane messages.
*
*\return       bleResult_t    Result of the operation.
********************************************************************************** */
bleResult_t App_RegisterLeCbCallbacks
(
    l2caLeCbDataCallback_t      pCallback,
    l2caLeCbControlCallback_t   pCtrlCallback
)
{
    pfL2caLeCbDataCallback = pCallback;
    pfL2caLeCbControlCallback = pCtrlCallback;

    return L2ca_RegisterLeCbCallbacks(App_L2caLeDataCallback, App_L2caLeControlCallback);
}

/*! *********************************************************************************
\fn            bleResult_t App_PostCallbackMessage(
*                  appCallbackHandler_t   handler,
*                  appCallbackParam_t     param
               )
*\brief        Store a callback message in the Cb App queue and signal application.
*
*\param  [in]  handler              Callback handler.
*\param  [in]  param                Callback parameter.
*
*\retval       gBleOutOfMemory_c    Message allocation fail.
*\retval       gBleSuccess_c        Successful addition to the Cb App queue.
********************************************************************************** */
bleResult_t App_PostCallbackMessage
(
    appCallbackHandler_t   handler,
    appCallbackParam_t     param
)
{
    appMsgCallback_t *pMsgIn = NULL;

    /* Allocate a buffer with enough space to store the packet */
    pMsgIn = MSG_Alloc(sizeof (appMsgCallback_t));

    if (pMsgIn == NULL)
    {
        return gBleOutOfMemory_c;
    }

    pMsgIn->handler = handler;
    pMsgIn->param = param;

    /* Put message in the Cb App queue */
    (void)MSG_QueueAddTail(&mAppCbInputQueue, pMsgIn);

    /* Signal application */
    (void)OSA_EventSet(mAppEvent, gAppEvtAppCallback_c);

    return gBleSuccess_c;
}

/*! *********************************************************************************
\fn            bleResult_t App_GenericCallback(gapGenericEvent_t* pGenericEvent)
*\brief        Callback used by the Host Stack to propagate GAP generic
*              events to the application.
*
*\param  [in]  pGenericEvent    Pointer to the GAP generic event.
*
*\retval       void.
********************************************************************************** */
void App_GenericCallback
(
    gapGenericEvent_t* pGenericEvent
)
{
    appMsgFromHost_t *pMsgIn = NULL;

    pMsgIn = MSG_Alloc((uint32_t)&(pMsgIn->msgData) + sizeof(gapGenericEvent_t));

    if (pMsgIn == NULL)
    {
        return;
    }

    pMsgIn->msgType = (uint32_t)gAppGapGenericMsg_c;
    FLib_MemCpy(&pMsgIn->msgData.genericMsg,
                pGenericEvent,
                sizeof(gapGenericEvent_t));

    /* Put message in the Host Stack to App queue */
    (void)MSG_QueueAddTail(&mHostAppInputQueue, pMsgIn);

    /* Signal application */
    (void)OSA_EventSet(mAppEvent, gAppEvtMsgFromHostStack_c);
}

/************************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
************************************************************************************/

/*! *********************************************************************************
*\private
*\fn           void App_HandleHostMessageInput(appMsgFromHost_t* pMsg)
*\brief        Handles all messages received from the host task.
*
*\param  [in]  pMsg    Pointer to the mesage received from the host task.
*
*\retval       void.
********************************************************************************** */
static void App_HandleHostMessageInput
(
    appMsgFromHost_t* pMsg
)
{
    bool_t matchFound = App_HandleHostMessageInput_Gap(pMsg);

    if (!matchFound)
    {
        matchFound = App_HandleHostMessageInput_Gatt(pMsg);
    }

    if (!matchFound)
    {
        matchFound = App_HandleHostMessageInput_L2ca(pMsg);
    }
}

/*! *********************************************************************************
*\private
*\fn           bool_t App_HandleHostMessageInput_Gap(appMsgFromHost_t* pMsg)
*\brief        Handles all messages received from the host task if the message
*              addresses GAP functionality. Called by App_HandleHostMessageInput().
*
*\param  [in]  pMsg    Pointer to the mesage received from the host task.
*
*\retval       TRUE     If the message type matched and a handler function was called
*\retval       FALSE    Message was not GAP layer related
********************************************************************************** */
static bool_t App_HandleHostMessageInput_Gap
(
    appMsgFromHost_t* pMsg
)
{
    bool_t matchFound = TRUE;
    switch ( pMsg->msgType )
    {
        case (uint32_t)gAppGapGenericMsg_c:
        {
            if (mpfGenericHandler != NULL)
            {
                mpfGenericHandler(&pMsg->msgData.genericMsg);
            }
            break;
        }
        case (uint32_t)gAppGapAdvertisementMsg_c:
        {
            if (pfAdvCallback != NULL)
            {
                pfAdvCallback(&pMsg->msgData.advMsg);
            }
            break;
        }
        case (uint32_t)gAppGapScanMsg_c:
        {
            if (pfScanCallback != NULL)
            {
                pfScanCallback(&pMsg->msgData.scanMsg);
            }
            break;
        }
        case (uint32_t)gAppGapConnectionMsg_c:
        {
            if (pfConnCallback != NULL)
            {
                pfConnCallback(pMsg->msgData.connMsg.deviceId,
                               &pMsg->msgData.connMsg.connEvent);
            }
            break;
        }
        default:
        {
            matchFound = FALSE;
                        break;
        }
    }

    return matchFound;
}

/*! *********************************************************************************
*\private
*\fn           bool_t App_HandleHostMessageInput_Gatt(appMsgFromHost_t* pMsg)
*\brief        Handles all messages received from the host task if the message
*              addresses GATT functionality. Called by App_HandleHostMessageInput().
*
*\param  [in]  pMsg    Pointer to the mesage received from the host task.
*
*\retval       TRUE     If the message type matched and a handler function was called
*\retval       FALSE    Message was not GATT layer related
********************************************************************************** */
static bool_t App_HandleHostMessageInput_Gatt
(
    appMsgFromHost_t* pMsg
)
{
    bool_t matchFound = TRUE;
    switch ( pMsg->msgType )
    {
        case (uint32_t)gAppGattServerMsg_c:
        {
            if (pfGattServerCallback != NULL)
            {
                pfGattServerCallback(pMsg->msgData.gattServerMsg.deviceId,
                                     &pMsg->msgData.gattServerMsg.serverEvent);
            }
            break;
        }
        case (uint32_t)gAppGattClientProcedureMsg_c:
        {
            if (pfGattClientProcCallback != NULL)
            {
                pfGattClientProcCallback(
                    pMsg->msgData.gattClientProcMsg.deviceId,
                    pMsg->msgData.gattClientProcMsg.procedureType,
                    pMsg->msgData.gattClientProcMsg.procedureResult,
                    pMsg->msgData.gattClientProcMsg.error);
            }
            break;
        }
        case (uint32_t)gAppGattClientNotificationMsg_c:
        {
            if (pfGattClientNotifCallback != NULL)
            {
                pfGattClientNotifCallback(
                    pMsg->msgData.gattClientNotifIndMsg.deviceId,
                    pMsg->msgData.gattClientNotifIndMsg.characteristicValueHandle,
                    pMsg->msgData.gattClientNotifIndMsg.aValue,
                    pMsg->msgData.gattClientNotifIndMsg.valueLength);
            }
            break;
        }
        case (uint32_t)gAppGattClientIndicationMsg_c:
        {
            if (pfGattClientIndCallback != NULL)
            {
                pfGattClientIndCallback(
                    pMsg->msgData.gattClientNotifIndMsg.deviceId,
                    pMsg->msgData.gattClientNotifIndMsg.characteristicValueHandle,
                    pMsg->msgData.gattClientNotifIndMsg.aValue,
                    pMsg->msgData.gattClientNotifIndMsg.valueLength);
            }
            break;
        }
        default:
        {
            matchFound = FALSE;
            break;
        }
    }
    return matchFound;
}

/*! *********************************************************************************
*\private
*\fn           bool_t App_HandleHostMessageInput_L2ca(appMsgFromHost_t* pMsg)
*\brief        Handles all messages received from the host task if the message
*              addresses L2CAP functionality. Called by App_HandleHostMessageInput().
*
*\param  [in]  pMsg    Pointer to the mesage received from the host task.
*
*\retval       TRUE     If the message type matched and a handler function was called
*\retval       FALSE    Message was not L2CAP layer related
********************************************************************************** */
static bool_t App_HandleHostMessageInput_L2ca
(
    appMsgFromHost_t* pMsg
)
{
    bool_t matchFound = TRUE;
    switch ( pMsg->msgType )
    {
        case (uint32_t)gAppL2caLeDataMsg_c:
        {
            if (pfL2caLeCbDataCallback != NULL)
            {
                pfL2caLeCbDataCallback(
                    pMsg->msgData.l2caLeCbDataMsg.deviceId,
                    pMsg->msgData.l2caLeCbDataMsg.channelId,
                    pMsg->msgData.l2caLeCbDataMsg.aPacket,
                    pMsg->msgData.l2caLeCbDataMsg.packetLength);
            }
            break;
        }
        case (uint32_t)gAppL2caLeControlMsg_c:
        {
            if (pfL2caLeCbControlCallback != NULL)
            {
                pfL2caLeCbControlCallback(&pMsg->msgData.l2caLeCbControlMsg);
            }
            break;
        }
        default:
        {
            matchFound = FALSE;
            break;
        }
    }
    return matchFound;
}

/*! *********************************************************************************
*\private
*\fn           void App_GattServerCallback(deviceId_t          peerDeviceId,
                                           gattServerEvent_t*  pServerEvent)
*\brief        Callback used by the Host Stack to propagate Gatt Server events
*              to the application.
*
*\param  [in]  peerDeviceId    Peer device id.
*\param  [in]  pServerEvent    Pointer to the Gatt Server event.
*
*\retval       void.
********************************************************************************** */
STATIC void App_GattServerCallback
(
    deviceId_t          peerDeviceId,
    gattServerEvent_t*  pServerEvent
)
{
    appMsgFromHost_t *pMsgIn = NULL;
    uint32_t msgLen = (uint32_t)&(pMsgIn->msgData) + sizeof(gattServerMsg_t);

