nxp-appcodehub/an-kw4x-bluetooth-le-nfc-integration/kw45b41zevk_w_uart_ncf3320_basic_discovery/source/common/app_conn.c
    pMsgIn->msgType = (uint32_t)gAppGattClientIndicationMsg_c;
    pMsgIn->msgData.gattClientNotifIndMsg.deviceId = deviceId;
    pMsgIn->msgData.gattClientNotifIndMsg.characteristicValueHandle =
                characteristicValueHandle;
    pMsgIn->msgData.gattClientNotifIndMsg.valueLength = valueLength;

    /*
     * Copy value after the gattClientIndIndMsg_t structure and update
     * the aValue pointer
     */
    pMsgIn->msgData.gattClientNotifIndMsg.aValue =
                (uint8_t*)&pMsgIn->msgData +
                sizeof(gattClientNotifIndMsg_t);
    FLib_MemCpy(pMsgIn->msgData.gattClientNotifIndMsg.aValue,
                aValue,
                valueLength);

    /* Put message in the Host Stack to App queue */
    (void)MSG_QueueAddTail(&mHostAppInputQueue, pMsgIn);

    /* Signal application */
    (void)OSA_EventSet(mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*! *********************************************************************************
*\private
*\fn           void App_L2caLeDataCallback(deviceId_t deviceId,
                                           uint16_t   channelId,
                                           uint8_t*   pPacket,
                                           uint16_t   packetLength)
*\brief        Callback used by the Host Stack to send L2CAP credit based data to
*              the application.
*
*\param  [in]  deviceId        Peer device id.
*\param  [in]  channelId       Identifier of the L2CAP channel used for credit based
*                              data transmission.
*\param  [in]  pPacket         Pointer to the L2CAP packet.
*\param  [in]  packetLength    Packet length.
*
*\retval       void.
********************************************************************************** */
STATIC void App_L2caLeDataCallback
(
    deviceId_t deviceId,
    uint16_t channelId,
    uint8_t* pPacket,
    uint16_t packetLength
)
{
    appMsgFromHost_t *pMsgIn = NULL;

    /* Allocate a buffer with enough space to store the packet */
    pMsgIn = MSG_Alloc((uint32_t)&(pMsgIn->msgData) +
                       (sizeof(l2caLeCbDataMsg_t) - 1U) +
                       (uint32_t)packetLength);

    if (pMsgIn == NULL)
    {
        return;
    }

    pMsgIn->msgType = (uint32_t)gAppL2caLeDataMsg_c;
    pMsgIn->msgData.l2caLeCbDataMsg.deviceId = deviceId;
    pMsgIn->msgData.l2caLeCbDataMsg.channelId = channelId;
    pMsgIn->msgData.l2caLeCbDataMsg.packetLength = packetLength;

    FLib_MemCpy(pMsgIn->msgData.l2caLeCbDataMsg.aPacket,
                pPacket,
                packetLength);

    /* Put message in the Host Stack to App queue */
    (void)MSG_QueueAddTail(&mHostAppInputQueue, pMsgIn);

    /* Signal application */
    (void)OSA_EventSet(mAppEvent, gAppEvtMsgFromHostStack_c);
}

/*! *********************************************************************************
*\private
*\fn           void App_L2caLeControlCallback(l2capControlMessage_t* pMessage)
*\brief        Callback used by the Host Stack to propagate L2CAP control events to
*              the application.
*
*\param  [in]  pMessage    Pointer to the L2CAP control message.
*
*\retval       void.
********************************************************************************** */
STATIC void App_L2caLeControlCallback
(
    l2capControlMessage_t* pMessage
)
{
    appMsgFromHost_t *pMsgIn = NULL;
    uint8_t messageLength = 0U;

    switch (pMessage->messageType) {
        case gL2ca_LePsmConnectRequest_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbConnectionRequest_t);
            break;
        }
        case gL2ca_LePsmConnectionComplete_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbConnectionComplete_t);
            break;
        }
        case gL2ca_LePsmDisconnectNotification_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbDisconnection_t);
            break;
        }
        case gL2ca_NoPeerCredits_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbNoPeerCredits_t);
            break;
        }
        case gL2ca_LocalCreditsNotification_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbLocalCreditsNotification_t);
            break;
        }
        case gL2ca_Error_c:
        {
            messageLength = (uint8_t)sizeof(l2caLeCbError_t);
            break;
        }

        case gL2ca_HandoverConnectionComplete_c:
        {
            messageLength = (uint8_t)sizeof(l2caHandoverConnectionComplete_t);
        }
        break;

        default:
        {
            messageLength = 0U;
            break;
        }
    }

    if (messageLength == 0U)
    {
        return;
    }

    /* Allocate a buffer with enough space to store the biggest packet */
    pMsgIn = MSG_Alloc((uint32_t)&(pMsgIn->msgData) + sizeof(l2capControlMessage_t));

    if (pMsgIn == NULL)
    {
          return;
    }

    pMsgIn->msgType = (uint32_t)gAppL2caLeControlMsg_c;
    pMsgIn->msgData.l2caLeCbControlMsg.messageType = pMessage->messageType;

    FLib_MemCpy(&pMsgIn->msgData.l2caLeCbControlMsg.messageData,
                &pMessage->messageData,
                messageLength);

    /* Put message in the Host Stack to App queue */
    (void)MSG_QueueAddTail(&mHostAppInputQueue, pMsgIn);

    /* Signal application */
    (void)OSA_EventSet(mAppEvent, gAppEvtMsgFromHostStack_c);
}


/*! *********************************************************************************
*\private
*\fn           void App_GenericHandler(gapGenericEvent_t *pGenericEvent)
*\brief        Handles BLE generic callback.
*
*\param  [in]  pGenericEvent    Pointer to gapGenericEvent_t.
*
*\retval       void.
********************************************************************************** */
static void App_GenericHandler
(
    gapGenericEvent_t *pGenericEvent
)
{
    /* Call application handler for advanced use */
    if (mpfAppGenericCallback != NULL)
    {
        mpfAppGenericCallback(pGenericEvent);
    }

    switch (pGenericEvent->eventType)
    {
        case gInitializationComplete_c:
        {
            /* Call application handler */
            if (mpfInitDoneCallback != NULL)
            {
                mpfInitDoneCallback();
            }
        }
        break;

        /* Direct advertising events to the advertising handler */
        case gAdvertisingParametersSetupComplete_c:
                            /* Fall Through */
        case gAdvertisingDataSetupComplete_c:
                            /* Fall Through */
        case gAdvertisingSetupFailed_c:
                            /* Fall Through */
        case gExtAdvertisingParametersSetupComplete_c:
                            /* Fall Through */
        case gExtAdvertisingDataSetupComplete_c:
        {
            if (pfAdvertiserHandler != NULL)
            {
                pfAdvertiserHandler(pGenericEvent->eventType);
            }
        }
        break;

        default:
        {
            ; /* No action required */
        }
        break;
    }
}

/*! *********************************************************************************
*\private
*\fn           void BluetoothLEHost_ProcessIdleTask(void)
*\brief        Handles Connectivity background task, usually executed from Idle task.
*
*\param  [in]  none.
*
*\retval       void.
********************************************************************************** */
void BluetoothLEHost_ProcessIdleTask(void)
{
#if (gAppUseNvm_d)
    NvIdle();
#endif /* gAppUseNvm_d */

#if defined gAppOtaASyncFlashTransactions_c && (gAppOtaASyncFlashTransactions_c > 0)
    OTA_TransactionResume();
#endif

}
